import { request } from '@/api/service'
export const crudOptions = (vm) => {
  return {
    pageOptions: {
      compact: true
    },
    options: {
      height: '100%'
    },
    viewOptions: {
      componentType: 'row'
    },
    formOptions: {
      defaultSpan: 12 // 默认的表单 span
    },
    columns: [
      {'title': '[采购申请]单号', 'width': 90, 'key': '[采购申请]单号'}
      ,
      {'title': '[采购申请]归属项目', 'width': 90, 'key': '[采购申请]归属项目'}
      ,
      {'title': '[采购申请]申请人', 'width': 90, 'key': '[采购申请]申请人'}
      ,
      {'title': '[采购申请]单据状态', 'width': 90, 'key': '[采购申请]单据状态'}
      ,
      {'title': '[采购申请]创建日期', 'width': 90, 'key': '[采购申请]创建日期'}
      ,
      {'title': '[采购申请]审核日期', 'width': 90, 'key': '[采购申请]审核日期'}
      ,
      {'title': '[采购申请]申请日期', 'width': 90, 'key': '[采购申请]申请日期'}
      ,
      {'title': '[采购申请]单据类型', 'width': 90, 'key': '[采购申请]单据类型'}
      ,
      {'title': '[采购申请]物料ID', 'width': 90, 'key': '[采购申请]物料ID'}
      ,
      {'title': '[采购申请]物料编码', 'width': 90, 'key': '[采购申请]物料编码'}
      ,
      {'title': '[采购申请]物料名称', 'width': 90, 'key': '[采购申请]物料名称'}
      ,
      {'title': '[采购申请]规格型号', 'width': 90, 'key': '[采购申请]规格型号'}
      ,
      {'title': '[采购申请]申请数量', 'width': 90, 'key': '[采购申请]申请数量'}
      ,
      {'title': '[采购申请]批准数量', 'width': 90, 'key': '[采购申请]批准数量'}
      ,
      {'title': '[采购申请]行业务关闭', 'width': 90, 'key': '[采购申请]行业务关闭'}
      ,
      {'title': '[采购申请]要求到货日期', 'width': 90, 'key': '[采购申请]要求到货日期'}
      ,
      {'title': '[采购申请]剩余数量', 'width': 90, 'key': '[采购申请]剩余数量'}
      ,
      {'title': '[采购申请]订单数量', 'width': 90, 'key': '[采购申请]订单数量'}
      ,
      {'title': '[采购申请]入库数量（几本单位）', 'width': 90, 'key': '[采购申请]入库数量（几本单位）'}
      ,
      {'title': '[采购申请]收料数量（几本单位）', 'width': 90, 'key': '[采购申请]收料数量（几本单位）'}
      ,
      {'title': '[采购订单]编号', 'width': 90, 'key': '[采购订单]编号'}
      ,
      {'title': '[采购订单]单据状态', 'width': 90, 'key': '[采购订单]单据状态'}
      ,
      {'title': '[采购订单]采购日期', 'width': 90, 'key': '[采购订单]采购日期'}
      ,
      {'title': '[采购订单]供应商', 'width': 90, 'key': '[采购订单]供应商'}
      ,
      {'title': '[采购订单]创建人', 'width': 90, 'key': '[采购订单]创建人'}
      ,
      {'title': '[采购订单]创建日期', 'width': 90, 'key': '[采购订单]创建日期'}
      ,
      {'title': '[采购订单]审核日期', 'width': 90, 'key': '[采购订单]审核日期'}
      ,
      {'title': '[采购订单]采购员', 'width': 90, 'key': '[采购订单]采购员'}
      ,
      {'title': '[采购订单]单据类型', 'width': 90, 'key': '[采购订单]单据类型'}
      ,
      {'title': '[采购订单]确认日期', 'width': 90, 'key': '[采购订单]确认日期'}
      ,
      {'title': '[采购订单]ID', 'width': 90, 'key': '[采购订单]ID'}
      ,
      {'title': '[采购订单]采购数量', 'width': 90, 'key': '[采购订单]采购数量'}
      ,
      {'title': '[采购订单]行业务关闭', 'width': 90, 'key': '[采购订单]行业务关闭'}
      ,
      {'title': '[采购订单]要求交货日期', 'width': 90, 'key': '[采购订单]要求交货日期'}
      ,
      {'title': '[采购订单]供应商承诺日期', 'width': 90, 'key': '[采购订单]供应商承诺日期'}
      ,
      {'title': '[采购订单]累计收料数量', 'width': 90, 'key': '[采购订单]累计收料数量'}
      ,
      {'title': '[采购订单]累计入库数量', 'width': 90, 'key': '[采购订单]累计入库数量'}
      ,
      {'title': '[采购订单]剩余收料数量', 'width': 90, 'key': '[采购订单]剩余收料数量'}
      ,
      {'title': '[采购订单]剩余入库数量', 'width': 90, 'key': '[采购订单]剩余入库数量'}
      ,
      {'title': '[采购订单]源单类型', 'width': 90, 'key': '[采购订单]源单类型'}
      ,
      {'title': '[采购订单]原单编号', 'width': 90, 'key': '[采购订单]原单编号'}
      ,
      {'title': '[采购订单]需求来源', 'width': 90, 'key': '[采购订单]需求来源'}
      ,
      {'title': '[采购订单]需求单据编号', 'width': 90, 'key': '[采购订单]需求单据编号'}
      ,
      {'title': '[采购订单]需求单据行号', 'width': 90, 'key': '[采购订单]需求单据行号'}
      ,
      {'title': '[采购订单]需求单据分录内码', 'width': 90, 'key': '[采购订单]需求单据分录内码'}
      ,
      {'title': '[收料通知单]编号', 'width': 90, 'key': '[收料通知单]编号'}
      ,
      {'title': '[收料通知单]单据状态', 'width': 90, 'key': '[收料通知单]单据状态'}
      ,
      {'title': '[收料通知单]创建人', 'width': 90, 'key': '[收料通知单]创建人'}
      ,
      {'title': '[收料通知单]创建日期', 'width': 90, 'key': '[收料通知单]创建日期'}
      ,
      {'title': '[收料通知单]审核日期', 'width': 90, 'key': '[收料通知单]审核日期'}
      ,
      {'title': '[收料通知单]审核人', 'width': 90, 'key': '[收料通知单]审核人'}
      ,
      {'title': '[收料通知单]ID', 'width': 90, 'key': '[收料通知单]ID'}
      ,
      {'title': '[收料通知单]物料ID', 'width': 90, 'key': '[收料通知单]物料ID'}
      ,
      {'title': '[收料通知单]本次交货数量', 'width': 90, 'key': '[收料通知单]本次交货数量'}
      ,
      {'title': '[收料通知单]实到数量', 'width': 90, 'key': '[收料通知单]实到数量'}
      ,
      {'title': '[收料通知单]订单单号', 'width': 90, 'key': '[收料通知单]订单单号'}
      ,
      {'title': '[收料通知单]原单内码', 'width': 90, 'key': '[收料通知单]原单内码'}
      ,
      {'title': '[收料通知单]原单分录内码', 'width': 90, 'key': '[收料通知单]原单分录内码'}
      ,
      {'title': '[收料通知单]原单单号', 'width': 90, 'key': '[收料通知单]原单单号'}
      ,
      {'title': '[收料通知单]实收数量', 'width': 90, 'key': '[收料通知单]实收数量'}
      ,
      {'title': '[收料通知单]预计到货日期', 'width': 90, 'key': '[收料通知单]预计到货日期'}
      ,
      {'title': '[收料通知单]采购订单分录代码', 'width': 90, 'key': '[收料通知单]采购订单分录代码'}
      ,
      {'title': '[收料通知单]确认交货数量', 'width': 90, 'key': '[收料通知单]确认交货数量'}
      ,
      {'title': '[收料通知单]确认到货日期', 'width': 90, 'key': '[收料通知单]确认到货日期'}
      ,
      {'title': '[检验单]单号', 'width': 90, 'key': '[检验单]单号'}
      ,
      {'title': '[检验单]单据状态', 'width': 90, 'key': '[检验单]单据状态'}
      ,
      {'title': '[检验单]审核人', 'width': 90, 'key': '[检验单]审核人'}
      ,
      {'title': '[检验单]审核日期', 'width': 90, 'key': '[检验单]审核日期'}
      ,
      {'title': '[检验单]创建人', 'width': 90, 'key': '[检验单]创建人'}
      ,
      {'title': '[检验单]创建日期', 'width': 90, 'key': '[检验单]创建日期'}
      ,
      {'title': '[检验单]单据日期', 'width': 90, 'key': '[检验单]单据日期'}
      ,
      {'title': '[检验单]检验数量', 'width': 90, 'key': '[检验单]检验数量'}
      ,
      {'title': '[检验单]质检开始日期', 'width': 90, 'key': '[检验单]质检开始日期'}
      ,
      {'title': '[检验单]质检结束日期', 'width': 90, 'key': '[检验单]质检结束日期'}
      ,
      {'title': '[检验单]物料编码ID', 'width': 90, 'key': '[检验单]物料编码ID'}
      ,
      {'title': '[检验单]原单类型', 'width': 90, 'key': '[检验单]原单类型'}
      ,
      {'title': '[检验单]原单编号', 'width': 90, 'key': '[检验单]原单编号'}
      ,
      {'title': '[检验单]原单内码', 'width': 90, 'key': '[检验单]原单内码'}
      ,
      {'title': '[检验单]原单分录内码', 'width': 90, 'key': '[检验单]原单分录内码'}
      ,
      {'title': '[检验单]原单行号', 'width': 90, 'key': '[检验单]原单行号'}
      ,
      {'title': '[采购入库]单号', 'width': 90, 'key': '[采购入库]单号'}
      ,
      {'title': '[采购入库]单据状态', 'width': 90, 'key': '[采购入库]单据状态'}
      ,
      {'title': '[采购入库]入库日期', 'width': 90, 'key': '[采购入库]入库日期'}
      ,
      {'title': '[采购入库]单据类型', 'width': 90, 'key': '[采购入库]单据类型'}
      ,
      {'title': '[采购入库]供应商', 'width': 90, 'key': '[采购入库]供应商'}
      ,
      {'title': '[采购入库]创建人', 'width': 90, 'key': '[采购入库]创建人'}
      ,
      {'title': '[采购入库]创建日期', 'width': 90, 'key': '[采购入库]创建日期'}
      ,
      {'title': '[采购入库]审核人', 'width': 90, 'key': '[采购入库]审核人'}
      ,
      {'title': '[采购入库]审核日期', 'width': 90, 'key': '[采购入库]审核日期'}
      ,
      {'title': '[采购入库]物料编码ID', 'width': 90, 'key': '[采购入库]物料编码ID'}
      ,
      {'title': '[采购入库]应收数量', 'width': 90, 'key': '[采购入库]应收数量'}
      ,
      {'title': '[采购入库]实收数量', 'width': 90, 'key': '[采购入库]实收数量'}
      ,
      {'title': '[采购入库]原单行内码', 'width': 90, 'key': '[采购入库]原单行内码'}
      ,
      {'title': '[采购入库]订单单号', 'width': 90, 'key': '[采购入库]订单单号'}
      ,
      {'title': '[采购入库]原单类型', 'width': 90, 'key': '[采购入库]原单类型'}
      ,
      {'title': '[采购入库]原单编码', 'width': 90, 'key': '[采购入库]原单编码'}
    ]
  }
}
